[Survived] Arithmetic mutation
stryker/src/MathzApp/Mathz.cs:6:16
 public class Mathz
 {
     public int Add(int a, int b) {
-        return a + b;
+        return a - b;
     }
 

[Killed] Equality mutation
stryker/src/MathzApp/Mathz.cs:10:16
     }
 
     public bool GreaterOrEqual(int a, int b) {
-        return a >= b;
+        return a > b;
     }
 }
killedBy: TestMathzApp.MathzTests.TestGreaterOrEqual

[Killed] Equality mutation
stryker/src/MathzApp/Mathz.cs:10:16
     }
 
     public bool GreaterOrEqual(int a, int b) {
-        return a >= b;
+        return a < b;
     }
 }
killedBy: TestMathzApp.MathzTests.TestGreaterOrEqual
