[NoCoverage] Statement mutation
stryker/src/MathzApp/Program.cs:8:9
     public static void Main()
     {
         var m = new Mathz();
-        Console.WriteLine("1 + 3 = " + m.Add(1, 3));
+        ;
     }
 }
