[NoCoverage] Statement mutation
stryker-2/src/MathLib/Program.cs:8:9
     public static void Main()
     {
         var adder = new Addition();
-        Console.WriteLine("1 + 3 = " + adder.Add(1, 3));
+        ;
     }
 }
