[Killed] Block removal mutation
src/MathLib/Util/NumberUtils.cs:6:5
 public static class NumberUtils
 {
     public static bool IsValidInteger(string input)
-    {
-        return int.TryParse(input, out _);
-    }
+    {}
 
     public static string ToOrdinal(int number)
killedBy: TestMathLib.NumberUtilsTest.IsValidInteger_WithValidInteger_ReturnsTrue

[Killed] Equality mutation
src/MathLib/Util/NumberUtils.cs:12:13
 
     public static string ToOrdinal(int number)
     {
-        if (number <= 0)
+        if (number > 0)
             return number.ToString();
 
killedBy: TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal

[Killed] Negate expression
src/MathLib/Util/NumberUtils.cs:12:13
 
     public static string ToOrdinal(int number)
     {
-        if (number <= 0)
+        if (!(number <= 0))
             return number.ToString();
 
killedBy: TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal

[Killed] Arithmetic mutation
src/MathLib/Util/NumberUtils.cs:15:17
         if (number <= 0)
             return number.ToString();
 
-        switch (number % 100)
+        switch (number * 100)
         {
             case 11:
killedBy: TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal

[Killed] Arithmetic mutation
src/MathLib/Util/NumberUtils.cs:23:17
                 return number + "th";
         }
 
-        switch (number % 10)
+        switch (number * 10)
         {
             case 1:
killedBy: TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal

[Killed] String mutation
src/MathLib/Util/NumberUtils.cs:30:33
             case 2:
                 return number + "nd";
             case 3:
-                return number + "rd";
+                return number + "";
             default:
                 return number + "th";
killedBy: TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal; TestMathLib.NumberUtilsTest.ToOrdinal_WithVariousNumbers_ReturnsCorrectOrdinal
