[Killed] Negate expression
src/MathLib/Util/StringUtils.cs:16:13
 
     public static string Reverse(string value)
     {
-        if (IsNullOrEmpty(value))
+        if (!(IsNullOrEmpty(value)))
             return value;
 
killedBy: TestMathLib.StringUtilsTest.Reverse_ShouldReturnReversedStrings; TestMathLib.StringUtilsTest.Reverse_ShouldReturnReversedStrings

[Killed] Statement mutation
src/MathLib/Util/StringUtils.cs:20:9
             return value;
 
         char[] array = value.ToCharArray();
-        Array.Reverse(array);
+        ;
         return new string(array);
     }
killedBy: TestMathLib.StringUtilsTest.Reverse_ShouldReturnReversedStrings
