[Killed] Block removal mutation
stryker-2/src/MathLib/Vector.cs:11:5
     public double Y { get; }
 
     public Vector(double x, double y)
-    {
-        X = x;
-        Y = y;
-    }
+    {}
 
     public Vector Add(Vector other)
killedBy: TestMathLib.VectorTests.Magnitude_SingleVector_ShouldReturnCorrectMagnitude; TestMathLib.VectorTests.Add_TwoVectors_ShouldReturnCorrectSum

[Killed] Arithmetic mutation
stryker-2/src/MathLib/Vector.cs:18:40
 
     public Vector Add(Vector other)
     {
-        return new Vector(X + other.X, Y + other.Y);
+        return new Vector(X + other.X, Y - other.Y);
     }
 
killedBy: TestMathLib.VectorTests.Add_TwoVectors_ShouldReturnCorrectSum

[Killed] Arithmetic mutation
stryker-2/src/MathLib/Vector.cs:18:27
 
     public Vector Add(Vector other)
     {
-        return new Vector(X + other.X, Y + other.Y);
+        return new Vector(X - other.X, Y + other.Y);
     }
 
killedBy: TestMathLib.VectorTests.Add_TwoVectors_ShouldReturnCorrectSum

[Survived] Arithmetic mutation
stryker-2/src/MathLib/Vector.cs:23:40
 
     public Vector Subtract(Vector other)
     {
-        return new Vector(X - other.X, Y - other.Y);
+        return new Vector(X - other.X, Y + other.Y);
     }
 

[Survived] Arithmetic mutation
stryker-2/src/MathLib/Vector.cs:23:27
 
     public Vector Subtract(Vector other)
     {
-        return new Vector(X - other.X, Y - other.Y);
+        return new Vector(X + other.X, Y - other.Y);
     }
 

[Killed] Arithmetic mutation
stryker-2/src/MathLib/Vector.cs:28:26
 
     public double Magnitude()
     {
-        return Math.Sqrt(X * X + Y * Y);
+        return Math.Sqrt(X / X + Y * Y);
     }
 
killedBy: TestMathLib.VectorTests.Magnitude_SingleVector_ShouldReturnCorrectMagnitude

[Killed] Arithmetic mutation
stryker-2/src/MathLib/Vector.cs:28:34
 
     public double Magnitude()
     {
-        return Math.Sqrt(X * X + Y * Y);
+        return Math.Sqrt(X * X + Y / Y);
     }
 
killedBy: TestMathLib.VectorTests.Magnitude_SingleVector_ShouldReturnCorrectMagnitude
